# Data Input and Output

• <b>CSV</b><br>
• <b>Excel</b><br>
• <b>HTML</b><br>
• <b>SQL</b><br>

# Reading Writing CSV

In [3]:
import pandas as pd
import bs4
import html5lib

In [29]:
pwd

'D:\\Documents\\Python Youtube Channel\\Data Science\\YouTube JupyterNotebook Project\\Workbooks\\Pandas'

In [30]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [31]:
df = pd.read_csv('example')

In [32]:
df.to_csv('My_output')

In [33]:
pd.read_csv('My_output')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In the above example, the index gets saved as a new unnamed column!, so to prevent that we need to say a new argument as, "index=False" which wil not save the index as a new unnamed column!

In [34]:
df.to_csv('My_output', index=False)

In [35]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In the above example, we said index = False, so that the index doesn't get saved as a new column!

# Reading Writing Excel Files

In [46]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [51]:
df.to_excel('Excel_Sample2.xlsx', sheet_name="NewSheet", index=False)

In [52]:
pd.read_excel('Excel_Sample2.xlsx')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# Reading Writing HTML

In [20]:
df = pd.read_html('https://www.w3schools.com/html/html_tables.asp')

In [21]:
type(df)

list

In [22]:
df[0]

                        Company           Contact  Country
0           Alfreds Futterkiste      Maria Anders  Germany
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy

# Working with SQL (Optional)

....